RIET/src/InformationRegisters/DOCVersions/DOCVersions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DOCVersions</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </resources>
  <resources>
    <name>MOT</name>
    <type>
      <types>CatalogRef.MOTs</types>
    </type>
  </resources>
  <resources>
    <name>Requested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>POA</name>
    <type>
      <types>CatalogRef.SeaAndAirPorts</types>
    </type>
  </resources>
  <resources>
    <name>Received</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Accepted</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзменилсяСостав</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Version</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>DOC</name>
    <type>
      <types>DocumentRef.КонсолидированныйПакетЗаявокНаПеревозку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/КонсолидированныйПакетЗаявокНаПеревозку/КонсолидированныйПакетЗаявокНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонсолидированныйПакетЗаявокНаПеревозку</name>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <attributes>
    <name>ИмпортЭкспорт</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>GOLD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POD</name>
    <type>
      <types>CatalogRef.CountriesHUBs</types>
    </type>
  </attributes>
  <attributes>
    <name>DirectlyToTheHub</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsignTo</name>
    <type>
      <types>CatalogRef.ConsignTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Seller</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>MOT</name>
    <type>
      <types>CatalogRef.MOTs</types>
    </type>
  </attributes>
  <attributes>
    <name>RequestedPOA</name>
    <type>
      <types>CatalogRef.SeaAndAirPorts</types>
    </type>
  </attributes>
  <attributes>
    <name>Urgency</name>
    <type>
      <types>EnumRef.Urgencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Coordinator</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВажности</name>
    <type>
      <types>EnumRef.СтатусыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Requested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accepted</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCAFirstResponse</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Granted</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Booked</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStage</name>
    <type>
      <types>EnumRef.DOCStages</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStatus</name>
    <type>
      <types>EnumRef.DOCStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStatusDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WithoutGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HouseKeeping</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentComment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>650</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>SegmentsList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SanctionedItems</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PendingEUC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PermitsRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>COORequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>FormalGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteeLetterRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>SentToTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SentToTMSDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceLocation</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionSpecialist</name>
    <type>
      <types>CatalogRef.SLSRCA</types>
    </type>
  </attributes>
  <attributes>
    <name>SubmittedByTransactionSpecialist</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>GL_FromSegment</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCAReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCA_Coordinator</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ReRoute</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfLines</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfUniqueLines</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Инвойсы</name>
    <attributes>
      <name>Инвойс</name>
      <type>
        <types>DocumentRef.Инвойс</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ManualStatuses</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>EnumRef.DOCStatuses</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Version</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TMS_OB</name>
    <attributes>
      <name>OBNo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ApprovalBorgs</name>
    <attributes>
      <name>Borg</name>
      <type>
        <types>CatalogRef.BORGs</types>
      </type>
    </attributes>
    <attributes>
      <name>Approve</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ApproveDate</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TNVEDCodesOfBroker</name>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.Инвойс</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>TNVEDBroker</name>
      <type>
        <types>CatalogRef.TNVEDCodes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/InformationRegisters/DOCVersions/ManagerModule.bsl
Процедура СоздатьВерсию(DOC, MOT, CCA, Requested, Знач POA = Неопределено, ИзменилсяСостав = Ложь) Экспорт
	
	НаборЗаписей = РегистрыСведений.DOCVersions.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписей.Отбор.DOC.Установить(DOC);
	НаборЗаписей.Прочитать();
	Запись = НаборЗаписей.Добавить();
	Запись.Период 			= ТекущаяДата();
	Запись.Version 			= Документы.КонсолидированныйПакетЗаявокНаПеревозку.rgsПолучитьМаксимальнуюВерсию(DOC) + 1;
	Запись.DOC 				= DOC;
	Запись.Регистратор 		= DOC;
	Запись.CCA 				= CCA;
	Запись.MOT 				= MOT;
	Запись.Received 		= Дата("01.01.0001 00:00:00");
	Запись.Accepted 		= Дата("01.01.0001 00:00:00");
	Запись.ИзменилсяСостав 	= ИзменилсяСостав;
	Запись.Requested 		= Requested;
	Запись.POA				= POA;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьВерсию(НомерВерсии, DOC, MOT, CCA, Requested, POA, Received, Accepted, ИзменилсяСостав = Ложь) Экспорт
	
	НаборЗаписей = РегистрыСведений.DOCVersions.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписей.Отбор.DOC.Установить(DOC);
	НаборЗаписей.Прочитать();
	Запись = НаборЗаписей.Добавить();
	Запись.Период 			= ТекущаяДата();
	Запись.Version 			= НомерВерсии;//Документы.КонсолидированныйПакетЗаявокНаПеревозку.rgsПолучитьКоличествоВерсий(DOC) + 1;
	Запись.DOC 				= DOC;
	Запись.Регистратор 		= DOC;
	Запись.CCA 				= CCA;
	Запись.MOT 				= MOT;
	Запись.Received 		= Received;
	Запись.Accepted 		= Accepted;
	Запись.ИзменилсяСостав 	= ИзменилсяСостав;
	Запись.Requested 		= Requested;
	Запись.POA				= POA;
	НаборЗаписей.Записать();
	
КонецПроцедуры
